In this exercise, I am tasked with setting up a database for a championship and populating it with initial data. The database will consist of four tables: "teams," "coaches," "balls," and "experiences." Each table has specific columns to store information related to teams, coaches, soccer balls, and the experiences of coaches with different teams and age groups.

The goal was to create the database and tables, define the appropriate data types for the columns, establish relationships between tables using foreign keys, and finally, insert sample records into each table to populate them. This exercise was designed to familiarize with the process of database creation and data insertion.

Create the database "Championship"

In [ ]:
CREATE DATABASE Championship;

Create the following tables, making sure to define data types according to what you consider most appropriate for the possible field values of the tables below, as well as the relationships with their respective foreign keys.

a. teams (team_id, name, city, director)
b. coaches (coach_id, name, age, phone)
c. balls (reference, team_id, manufacturer)
d. experiences (team_id, coach_id, category, years)

In [ ]:
CREATE TABLE team (
    team_id INT PRIMARY KEY,
    name VARCHAR(50),
    city VARCHAR(50),
    director VARCHAR(50)
);

CREATE TABLE coaches (
    coach_id INT PRIMARY KEY,
    name VARCHAR(50),
    age INT,
    phone VARCHAR(9)
);

CREATE TABLE balls (
    reference INT,
    team_id INT,
    manufacturer VARCHAR(50),
    CONSTRAINT pk_balls PRIMARY KEY (reference, team_id),
    FOREIGN KEY (team_id) REFERENCES team(team_id)
);


CREATE TABLE experiences (
    team_id INT,
    coach_id INT,
    category VARCHAR(50),
    years INT,
    CONSTRAINT pk_experiences PRIMARY KEY (team_id, coach_id, category),
    FOREIGN KEY (team_id) REFERENCES team(team_id),
    FOREIGN KEY (coach_id) REFERENCES coaches(coach_id)
);

Insert records into each of the created tables.

In [ ]:
INSERT INTO team (team_id, name, city, director) VALUES
(12, 'Academic', 'Porto', 'Mario'),
(15, 'University', 'Coimbra', 'Joao'),
(20, 'Youth', 'Braga', 'Silva'),
(24, 'Tigers', 'Espinho', 'Cardoso');


INSERT INTO coaches (coach_id, name, age, phone) VALUES
(1, 'Antonio', 34, '922424561'),
(2, 'Barbosa', 45, '965552936'),
(3, 'Tavares', 48, '933332267'),
(4, 'Joaquim', 57, '918638465'),
(5, 'Alberto', 33, '966785309'),
(6, 'Duarte', 54, '912773446');


INSERT INTO balls VALUES
(1, 12, 'Adidas'),
(9, 12, 'Reebok'),
(13, 12, 'Adidas'),
(1, 15, 'Adidas'),
(3, 20, 'Olimpic'),
(4, 20, 'Nike'),
(18, 24, 'Reebok'),
(21, 24, 'Olimpic');

INSERT INTO experiences VALUES
(12, 1, 'juniors', 10),
(12, 1, 'seniors', 5),
(12, 2, 'beginners', 2),
(12, 2, 'juniors', 3),
(12, 2, 'youth', 4),
(15, 3, 'juniors', 15),
(24, 5, 'youth', 12);

-- Create the following queries:
--a. Show all data from the "Teams" table;
SELECT *
FROM team;

--b. Show all data from the team with an ID equal to 12;
SELECT *
FROM team
WHERE team_id = 12;

--c. Show the ID and name of all teams;
SELECT team_id, name
FROM team;

--d. Show the ID, name, and age of coaches under 40 years of age;
SELECT coach_id, name, age
FROM coaches
WHERE age < 40;

--e. Show all data from the "Experiences" table related to coaches who coached juniors or have more than 10 years of experience;
SELECT *
FROM experiences
WHERE category = 'juniors' OR years > 10;

--f. Show all data of coaches whose age falls within the [45, 53] interval and in descending order of age;
SELECT *
FROM coaches
WHERE age BETWEEN 45 AND 53
ORDER BY age DESC;

--g. Show all data of balls from the Reebok and Olimpic manufacturers;
SELECT *
FROM balls
WHERE manufacturer IN ('Reebok', 'Olimpic');
--WHERE manufacturer='Reebok' OR manufacturer='Olimpic'

--h. Show all data of coaches whose names start with the letter A;
SELECT *
FROM coaches
WHERE name like 'A%';

--i. Show the number of teams participating in the championship;
SELECT category, COUNT(team_id) as total_teams
FROM experiences
GROUP BY category;

--j. Show the number of distinct manufacturers producing balls used in the championship;
SELECT manufacturer, COUNT(DISTINCT manufacturer) as Manufacturer_Count
FROM balls
GROUP BY (manufacturer);

--k. Show the number of coaches older than 40 years;
SELECT COUNT(coach_id) as Coach_Count_Over_40
FROM coaches
WHERE age > 40;

--l. Show the age of the oldest coach;
SELECT MAX(age) AS OLDEST_COACH_AGE
FROM coaches;

--m. Show the IDs of teams that use Adidas manufacturer's balls;
SELECT team_id 
FROM balls
WHERE manufacturer='Adidas';

--n. Show the result of the previous query without repetitions;
SELECT DISTINCT team_id 
FROM balls
WHERE manufacturer='Adidas';

--o. Show the average ages of coaches for the "juveniles" category;
SELECT AVG(t.age) AS AVERAGE_AGES, e.category AS Category
FROM coaches t
INNER JOIN experiences e ON t.coach_id=e.coach_id
WHERE e.category='juveniles'
GROUP BY e.category;

--p. Show all data of coaches and the teams they coach;
SELECT t.* , eq.*
FROM coaches t
INNER JOIN experiences e ON t.coach_id=e.coach_id
INNER JOIN team eq ON e.team_id=eq.team_id;

--q. Show the names and phones of coaches and the names of the teams they coach;
SELECT t.name, t.phone, eq.name
FROM coaches t
INNER JOIN experiences e ON t.coach_id=e.coach_id
INNER JOIN team eq ON e.team_id=eq.team_id;

--r. Show all data of the "Academic" team and its respective coaches;
SELECT DISTINCT eq.*, t.* 
FROM team eq
INNER JOIN experiences e ON eq.team_id=e.team_id
INNER JOIN coaches t ON e.coach_id=t.coach_id
WHERE eq.name LIKE 'Academic';

--s. Show the age of the oldest coach of the "Academic" team;
SELECT MAX(t.age) AS OLDEST_COACH_AGE
FROM coaches t
INNER JOIN experiences e ON eq.team_id=e.team_id;

--t. Show the total years of experience of Coach Antonio from the "Academic" team.
SELECT t.name , SUM(e.years) AS Experience_Years
FROM coaches t
INNER JOIN experiences e ON t.coach_id=e.coach_id
INNER JOIN team eq ON e.team_id=eq.team_id
WHERE t.name LIKE 'Antonio' AND eq.name LIKE 'Academic'
ORDER BY t.name;